# Ultralytics YOLO11-cls image classification model with ResNet50 backbone
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/classify

# Parameters
# nc: 10  # number of classes

# # ResNet50 backbone
# backbone:
#   - [-1, 1, TorchVision, [2048, resnet50, DEFAULT, True, 2]]  # 注意：输出通道是 2048

# # YOLO11 head
# head:
#   - [-1, 1, Classify, [nc]]


# Ultralytics YOLO11-cls image classification model with ResNet34 backbone

# Parameters
nc: 10  # number of classes

# ResNet34 backbone
backbone:
  - [-1, 1, TorchVision, [512, resnet34, DEFAULT, True, 2]]  # 输出通道 512，截断后两层

# YOLO11 head
head:
  - [-1, 1, Classify, [nc]]
